Feature/oid4vci formats (#47)
* feat: added vcdm

- Added VCDM packages
- Update docs

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update oid4vci and oid4vp

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update oid4vp and oid4vci

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: updated the status list to draft 20

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update haip and docs

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update oid4vp and presentationexchange

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update sdjwt

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: implement siopv2

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update oidfederation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update sd  jwt vc

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: clean up proposal docs

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update the proposal

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update documentation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update docs

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update mdoc

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update documentation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: improve documentation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update docs

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* feat: update dc api

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update documentation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update documentation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update documentation

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>

* docs: update docs

Signed-off-by: Thomas Tran <tldinteractive@gmail.com>
